_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 26, 26, 16)        160       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 13, 13, 16)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 11, 11, 16)        2320      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 5, 5, 16)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 400)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 56)                22456     
_________________________________________________________________
dense_2 (Dense)              (None, 10)                570       
=================================================================
Total params: 25,506
Trainable params: 25,506
Non-trainable params: 0
_________________________________________________________________

epochs: 20
batch_size: 128
checkpoints: 1
train_size: 60000
test_size: 6000