_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 26, 26, 10)        100       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 13, 13, 10)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 1690)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 10)                16910     
=================================================================
Total params: 17,010
Trainable params: 17,010
Non-trainable params: 0
_________________________________________________________________

epochs: 5
batch_size: 128
checkpoints: 1
train_size: 60000
test_size: 6000